app/controllers/api/v1/plants_controller.rb

SELECT "plants".* FROM "plants"
---
    def index
        plants = Plant.all

SELECT  "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        plant = Plant.find_by(id: params[:id])