app/controllers/api/v1/rooms_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        room = Room.all.find_by(id: params[:id])