app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "guy"], ["password_digest", "$2a$12$7pGFiPGIYqpURppoYfCXgOb4.Wndn35PFzyjQWDuX.hyk6eTKEotW"], ["created_at", "2019-06-28 14:43:57.913316"], ["updated_at", "2019-06-28 14:43:57.913316"]]
---
   def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        user = User.find(id: params[:id])