app/controllers/application_controller.rb

    def current_user
        id = decode_token['id']
        User.find_by(id: id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]