app/controllers/room_plants_controller.rb

    def index
        room_plants = RoomPlant.all
---
SELECT "room_plants".* FROM "room_plants"