app/controllers/rooms_controller.rb

    def index
        rooms = Room.all
---
SELECT "rooms".* FROM "rooms"

    def show
        room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        room = Room.new(user_id: room_params[:user_id], name: room_params[:name])

        if room.save
---
INSERT INTO "rooms" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["name", "Study"], ["created_at", "2019-07-02 22:45:59.413917"], ["updated_at", "2019-07-02 22:45:59.413917"]]

    def destroy
        room = Room.find_by(id: params[:id])
        room.destroy
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 1]]