app/controllers/suggestions_controller.rb

SELECT "suggestions".* FROM "suggestions"
---
    def index
        @suggestions = Suggestion.all

INSERT INTO "suggestions" ("plant_id", "suggestion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["plant_id", 2], ["suggestion", "cacti actually grow best in 40 degrees, not 20"], ["created_at", "2019-07-02 14:08:02.869213"], ["updated_at", "2019-07-02 14:08:02.869213"]]
---
    def create
      suggestion = Suggestion.new(plant_id: params[:plant_id], suggestion: params[:suggestion])

      if suggestion.save